{"podcast_details": {"podcast_title": "The Mindset Mentor", "episode_title": "The Main Problem of Personal Development", "episode_image": "https://play.cdnstream1.com/zjb/image/download/6c/57/4d/6c574d6b-2a5a-485b-9401-b1f9f2aa5d6b_1400.jpg", "episode_transcript": " Welcome to today's episode of the mindset mentor podcast. I'm your host Rob Dial. If you have not yet done so hit that subscribe button so that you never miss another podcast episode. And if you love this podcast, you'll probably love my new book that's coming out. It is called Level Up How to Get Focused Stop Procrastinating and Upgrade Your Life. If you want to go ahead and preorder that book, go ahead and go to robdial.com slash book, you will get entered into a prize pool of over $25,000 cash and prizes. And you will also get a free course on how to stop procrastinating. Today, we're going to be talking about the main problems that I see with personal development. And I've been now in the personal development industry, I guess you could say for about 17 years, started when I was 20 years old, I started getting obsessed with it. And I've actually been teaching people and literally been a coach or even had this podcast now for eight years. And so with eight years of having this podcast, and what are we at over 250 million downloads, many people have reached out to me, and I've had many conversations on Instagram with people in my DMS. And I've come to find there's two things that I really noticed that hold people back with personal development. First thing that I noticed is that when we start to get into personal development, we start to notice things that we want to improve in ourselves, right? It doesn't mean there's something wrong with us, it just means we want to improve certain aspects of ourselves. And so if you can imagine like just a straight line across a piece of paper, right? And we call that normal. And that's just normal. Whenever we start to learn about ourselves, and ignorance is bliss, where you don't understand anything about yourself, and still you start diving into personal development, you start seeing these things that you start to want to improve, and you view these things as flaws. And so if you look at the normal line, what we start thinking is we're now below the normal line, we're not normal anymore, now there's something wrong with us. And what happens is a lot of people I notice, they view themselves, is there something wrong with them? Now that they're aware, they have a spotlight on, I have an anger issue, they have a spotlight on, I need to work on my meditation, they have a spotlight on, I have too much anxiety or too much stress, whatever it might be, they now think that there's something wrong with them, and they view themselves as below the line of normal. And so that brings a lot of stress, because then they start thinking that there's something wrong with them, they're not normal, and they now think I need to improve myself just to be normal. I need to get better, like I'm so below the normal line that I need to put a lot of time and effort into myself just to make myself normal in this world. And they start thinking there's something wrong with them. I don't know if you've ever felt this way, but I've felt this way, and I've seen many people send me DMs, and I've spoken to many people who feel this way, there's something wrong with them, and now they're just trying to get back to normal. And it doesn't feel motivating to try to get to just normal, to go, I'm below normal, now I've got to work on myself just to be okay. That doesn't feel motivating, does it? I want you to realize, if you have stress, if you have anxiety, if you need to work on yourself, if there's things that you need to improve upon in yourself, you are normal. You're not below the normal line, you are normal. And so there's nothing wrong with you now, and to get better, like, oh, I need to get better implies that you are currently worse. And so I don't want you to think that you, in order to get better, means that you're inherently worse, and there's something wrong with you. What I want you to realize is that you are normal, and every aspect that you put into yourself to improve yourself just brings a new, evolved version of yourself. That's the first thing that I notice is a really big problem with personal vomit. Now that you're aware, don't think there's something wrong with you. The second thing that I noticed, which we're going to talk about much longer today, is once we notice that we're trying to get better, we get this feeling of when will I get there? Oh, when am I going to get there? When am I finally going to get the destination? I see a lot of people wanting to get to this destination, wondering when all of their problems will go away, when they'll be perfect, when will I finally be perfect, when will I get there, wherever there is. I've caught myself there many times. I have an issue, I work on the issue for a little while, I start to feel much better about myself, and then what happens? I fall back into that thing, that issue that I was working with, and I do what I thought I was done with, and I'm like, what the hell? I thought I was done with this thing. Damn it. What's wrong with me? I thought I was done with that. That anger thing. I thought I was done with my anger. I just got angry. Oh, there's something wrong with me. Oh my gosh, I've been working on mindfulness. This person's cut me off, and I just cussed them out, flicked them off, and threw my coffee at their car. So it's like, hopefully you're not doing that. You're not that crazy. But you're looking at it, and you're thinking to yourself, I thought I was done with this thing. And then what happens is because of this thing coming back around, whatever that thing is, let's say it's anger just to make it something we can add some context to, my anger comes back. Then I start to shame and guilt myself because this thing I'm supposed to be perfect at is now back. I want you to understand this. Have you ever found yourself there first off? Have you ever thought to yourself that you were past something, and then you realize that you are not? And then you shame yourself or guilt yourself, and you kick yourself in the crotch over it? Well, with personal development, with self-development, with spiritual development, I want you to understand this. There's a good chance that you're going to live the rest of your life, and you're never going to get quote unquote there. With personal development, spiritual development, self-development, there is no destination. I don't know if you'll ever get fully past something. I've been worrying myself for 17 years. I'm not past anything. I'm a little bit better at everything, but I'm not past anything. And all of my shit comes to the surface at some point in time. It doesn't come to the surface as much as it used to, but it will come back again. I'll say something and be like, why did I say that? I'll think something and be like, where the hell did that come from? I thought I was past this thing. All I can say is not just from my own experience, but seeing people that I've worked with and talked to, I've even seen people that I feel are spiritual teachers that are way past where I am. 40, 50 years more of working on themselves than I met. And even they say that they fall into these things. And people who know them say they fall into those things. If they're way past me, if they've been working on themselves for 60 years, and they're in their 80s right now, I'm 37 years old. I've been working myself for 17 years. Who's to say that this person that I look up to, that has been working on themselves for 60 years, is still not past their shit? Who's to say that I won't ever get past it? And so I see it and I go, man, if they're not past it, will I ever get there? Will I ever get to this destination? So I don't think it's about finding a destination of being done. I think that it's about really understanding that we will constantly be needing to improve ourselves. We'll constantly, until the day we die, be more of an evolved being. We're going to evolve ourselves day after day after day after day. You're kind of like an onion. You get past one thing and there's just another layer, and there's just another layer, and there's just another layer. Hey, are you a coach, consultant, or expert in your field, but you struggle with how to market and sell your services effectively? Well, you may not know this, but along with this podcast, I also own a company called the School for Online Coaches. And since 2019, myself and my team have trained and supported over 1,400 coaches in starting and growing their coaching businesses online. This is where I teach everything that you need to know to start and grow your own coaching business to $10,000 a month in as little as 30 to 60 days. So if you're dying to see what it's like to be your own boss, work remotely, and create a business that helps people change their lives and feels fulfilling to you, head over to schoolforonlinecoaches.com right now. That's where you can learn more information about how to grow your business. Once again, it is School for Online Coaches.com. And really what I think it comes down to is I think it comes down to, and I've said this before on the podcast, I think this is about shortening the time to getting back to regular, getting back to normal, getting back to homeostasis, right? So, you know, maybe something happened. It's about shortening your time where you're triggered by something. Personal development is just basically in my mind, shortening your reaction time to hopefully maybe not even having a reaction. If we can get to a point where there's no reaction, well, that's pretty good. I've noticed that when I have something that I thought I've gotten past and I'm done with it, and the more that I've started to work on myself, it eventually comes back up. The more that I have let go of trying to be there or to get there or to think that I'm going to be perfect, the more that I've let go of that perspective of I need to finally get there, the more I've let go of it, the more my happiness has gone up. So I think that, for instance, I always say this, like if I think about when I was younger, when I first got into personal development, when I was 19 years old, I was very lazy. I was very pessimistic. I got angry very easily. I held grudges a lot. For me now, I don't feel like I have much of that that still lives in me, but there's still parts of that that live inside of me. And really what it's about is instead of trying to get rid of quote unquote parts of you, the angry side of you, the pessimistic side of you, the vindictive side of you, whatever it might be, instead of trying to get rid of those parts, the selfish part of you, the ego part of you, all of that stuff, instead of trying to get rid of them, it's more about how do we integrate them into the whole, into the whole version of who you are. And so if it comes down to I'm trying to get rid of my anger, maybe when I was younger at 19 years old, before I started working with myself, something would happen to me. And I remember I would hold on to that thing for so long. She would do this to me. Like if I had a girlfriend, I was 19, she would do this to me and I would, I would be, it would happen to me on a Tuesday, I was pissed off on Wednesday, I was pissed off on Thursday, I was pissed off on Friday, Saturday, Sunday, Monday, Tuesday, I was pissed off for an entire week about something that happened to me on last Tuesday. And that's kind of how I was. And then I worked on myself for a few years and I got a little bit better and I got a little bit better. And then after a couple years of working on myself, I was only, instead of being pissed off for seven days, I was not pissed off for three days. Still not perfect, but I'm getting better, right? I'd much rather be pissed off for three days in seven, but I'm still not where I want to be. I'm still not at that destination. Then I started working myself for a couple more years, a couple of years, and now I'm pissed off, but I'm pissed off only for Tuesday. I'm only pissed off on the day that it happens. And this thing that happens to me ruins my entire day. Still one day, one day is better than three, one day is better than seven. So it's like, okay, I'm getting a little bit, getting a little bit better, AKA more improved, I'm evolving into a more decent version of myself. Then something happens to me, I'm pissed off for 12 hours. I'm working myself for a few more years and something happens to me and I'm pissed off for six hours and I'm pissed off for a couple hours and then pissed off for an hour. And then I'm pissed off for 15 minutes. I went from seven days to 15 minutes. That's a much better reaction time. And we keep working on ourselves and working ourselves and working ourselves and maybe we can get to the point, maybe, just maybe we could get to the point of our lives where that thing happens to us and there's no reaction. Maybe we'll get there, but maybe we don't. And if I, the more that I release the destination, the happier that I am because all too often we will fall back into our triggers. We will fall back into our patterns. And the worst thing we could do in that moment is judge ourselves and guilt ourselves and shame ourselves. And you're such an idiot. I thought you were past this. You've been working, you've been working yourself. You read 17 books last year and you're still not past this. You're an idiot. You're never going to get past this. It's like finding an old wound, noticing that it's open again. And instead of allowing it to just start to heal, you're like, screw it. Let's just pour some salt on top of this thing and make it worse. Let me just make myself more pissed off, more guilt, more shame. What if we never did that? What if we just learned that this whole human journey, as crazy as it is, it's amazing, it's beautiful, it's terrible, it's frightening, it's scary, it's everything in one. That is the whole human experience. What if this whole human journey that you're on is really just about getting lost and finding yourself and getting lost and finding yourself over and over and over again, 10,000 times a year. Because in order to find out who you are, you also have to find out who you're not. And so that means that you have to lose yourself to go and find yourself. There always has to be in life two sides of the coin. There's always the yin to the yang. You cannot know what the color white is without knowing what the color black is. Good cannot exist in this world without evil existing. Love cannot exist without fear existing. Now we might find times when we're way more loving than we ever have been. There's way less fear. But fear will still pop back up. It's just the way that it goes. There are always going to be two sides to a coin. So what if whenever we mess up and we realize it, we give ourselves some grace. We don't shame ourselves. We don't guilt ourselves for these things. And we go, you know what? I'm continuing to work on myself. I'm getting better. I'm better than I have ever been. And I'm better than I was two weeks ago. But there's still some things that I'm working on. I don't have to work on them. There's nothing wrong with me. I am just a normal human. And I am on the line of normal, not below the line. But we just go, you know what? I'm going to work on myself. And we just keep going. And we just keep going. And we just keep going. How does that feel now? How does that feel to think about that this destination, this thing that we're working towards may never get there? The only destination that we're ever really working towards in life is death. That's the destination we all know that we're going to get to. Maybe you will be angry your entire life, but it's not going to be as much anger as it has been. Maybe it's just a little bit of anger that pops up every once in a while. And you learn how to work through it. Maybe you will be selfish, and that's just who you are. But what you do is you learn how to use these things to make the whole complete being that you are. I've spoken about it, but when I was writing the book about a year ago, actually earlier this year when I was writing the book, I was noticing I was putting so much time into the book to make it perfect. And I was like, I got to make it perfect. I got to make it perfect. I got to make it better. And I would edit this sentence to make it better because I thought to myself, I just want to make sure that every line is as impactful as it possibly can be because I don't want to just put shit out into the world. I don't want to just write a book to write a book. I don't just want to just write it and then go on to the next one. I want to try to put everything that I possibly can into it. And I took a step back and I asked myself, is there a part of you where you're actually just being selfish? Let me take you through. When I said, is there a part of you that's being selfish? I was thinking about it and I was like, yeah, there is a part of me that does want this to be like a New York Times bestselling book. There's a part of me that wants me to be able to wear a little badge so where I can say, I'm a New York Times bestselling author. There's a part of me that wants to make a bunch of money off of the book and have it be something that sells 20 million copies. And people can be like, wow, that guy is so smart and such a good writer and he writes good books and stuff. There's a part of me that exists there. But instead of fighting that part of me, can I use that part of me to be better? Can I use that part of me to create a better book? And so there's a part of me that wants to fully impact Willis' book. There's also a little tiny part of me that's like, I want, there's selfish parts of me. I do want it to do really well. I do want to be able to say these things. But if I use the part of me that we're all trying to push away, the egoic side that we're trying to say, no, it doesn't exist. I don't want it. I hate this side of me. I hate this side of me. I hate this side of me. Can I look at the side of me and say, hey, this side of me, this selfish side of me, can you help me write a better book? Because if you can help me write a better book, it will impact more people's lives. And so what it comes down to is not trying to get rid of any part of you. It's trying to learn how to work with it, how to minimize it if it is bad, and how to actually work with it so that we can use it and create the full being of who we are. Because I promise you this, there's a pretty good chance you're not going to get to the rest of your life. You're not going to, if you're 40 years old right now, you're not going to get to 90 years old, be on your deathbed and never have another moment where you get angry and never have another moment where you're selfish and never have another moment where your ego doesn't pop up again. If you do, you're better than me. I don't expect to ever be there and be this enlightened being by the time I get done here. But can I take all aspects of myself, look at them, love them, work with them, and integrate them into the full being of what I am? That's what I'm really trying to work at. There is no destination and there is nothing wrong with you. So that's what I got for you for today's episode. If you love this episode, please do me a favor. Share it on your Instagram stories and tag me in at robdialjr. I'm going to leave you the same way I leave you every single episode. Make it your mission, make someone else's day better. I appreciate you and I hope that you have an amazing day."}, "podcast_summary": "In this episode of the Mindset Mentor podcast, host Rob Dial discusses two common problems that hold people back in personal development. The first problem Rob notices is that when people start learning about themselves and identifying areas they want to improve, they often view those aspects as flaws and think there is something wrong with them. Rob explains that wanting to improve oneself is normal and doesn't mean there is anything wrong. It's important to realize that the desire for self-improvement is a normal part of personal development. The second problem Rob talks about is the idea of reaching a destination in personal development. Many individuals wonder when they will finally get there and be perfect. Rob shares his personal experience of working on certain issues and thinking he was done with them, only to have them resurface later. He emphasizes that personal development is an ongoing journey and there is no destination. It's about continually evolving and improving oneself. Rob advises listeners to focus on shortening their reaction time to triggers and integrating all aspects of themselves into the complete being that they are. He encourages self-acceptance and grace when facing setbacks or recurring patterns. Rob suggests that rather than trying to get rid of certain parts of oneself, it's about working with them and using them to create a better version of oneself. He concludes by reminding listeners that there is no destination in personal development and there is nothing wrong with them. The key is to keep evolving and making each day better than the last.", "podcast_guest": {"name": "Rob Dial", "org": "The Mindset Mentor", "title": "", "summary": "Not Available"}, "podcast_highlights": "- Highlight 1 of the podcast: \"If you have stress, if you have anxiety, if you need to work on yourself, if there's things that you need to improve upon in yourself, you are normal.\"\n- Highlight 2 of the podcast: \"There's a good chance that you're going to live the rest of your life, and you're never going to get quote unquote there.\"\n- Highlight 3 of the podcast: \"In order to find out who you are, you also have to find out who you're not. And so that means that you have to lose yourself to go and find yourself.\"\n- Highlight 4 of the podcast: \"Instead of trying to get rid of quote unquote parts of you, the angry side of you, the pessimistic side of you, the vindictive side of you, whatever it might be, instead of trying to get rid of those parts, it's more about how do we integrate them into the whole, into the whole version of who you are.\"\n- Highlight 5 of the podcast: \"Can I take all aspects of myself, look at them, love them, work with them, and integrate them into the full being of what I am?\""}
